# DZ_Seminar-4

// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int sum = 0;
// while (number > 0)
// {
//     sum = sum + number % 10;
//     number = number / 10;
// }
// Console.Write(sum);

//  Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
//  1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19] 
// 6, 1, 33 -> [6, 1, 33]

// int[] nums = { 1, 2, 3, 4, 5, 6, 7, 8 };
//  void function(int[] array)
//  {
//      for (int i = 0; i < array.Length; i++)
//          Console.Write(array[i] + " ");
//  }
//  function(nums);

// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Console.Write("Ваедите число А: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.Write("Ваедите число В: ");
// int B = Convert.ToInt32(Console.ReadLine());
// int sum = 1;
//  for (int i = 1; i <= B; i++)
//  {
//      sum = sum * A;
//  }
//  Console.WriteLine(sum);